<!-- -*- mode: markdown; coding: utf-8; fill-column: 60; ispell-dictionary: "english" -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="../style.css">


# Our first Jupyter notebook

This is a [_Jupyter notebook_](https://jupyter.org/), it
contains _cells_ in which we can evaluate program code.

There is built in support for _Julia_, _Python_, and _R_
(hence _Ju-Pyt-R_), here's some Python code:

In [ ]:
def hello(name):
    print(f"hello, {name}!")

def main():
    name = input("What's your name: ")
    hello(name)
    
main()

You can run the code snippet above by clicking somewhere in
the box, and press Shift-Enter.

We're primarily going to run SQL code (see below) in our
notebooks, but I'll also show you some Python code later on
in the course.

You don't have to learn Python to take this course, there
will always be the option to use Java instead, but I
encourage you to have a look at Python, since it is growing
in popularity very quickly, and has become the 'lingua
franca' of data science (together with R).


## Introduction to relational databases

A [_Relational
Database_](https://en.wikipedia.org/wiki/Relational_database)
stores its data in [ _tables_
](https://en.wikipedia.org/wiki/Table_(database), where each
table looks like a simple spreadsheet:

<style type="text/css">
.tg  {border-collapse:collapse;border-spacing:0;border-color:#999;margin:0px auto;}
.tg td{font-family:Arial, sans-serif;font-size:14px;padding:10px 5px;border-style:solid;border-width:1px;overflow:hidden;word-break:normal;border-color:#999;color:#444;background-color:#F7FDFA;}
.tg th{font-family:Arial, sans-serif;font-size:14px;font-weight:normal;padding:10px 5px;border-style:solid;border-width:1px;overflow:hidden;word-break:normal;border-color:#999;color:#fff;background-color:#26ADE4;}
.tg .tg-e3zv{font-weight:bold}
.tg .tg-9hbo{font-weight:bold;vertical-align:top}
.tg .tg-yw4l{vertical-align:top}
</style>
<table class="tg">
  <tr>
    <th class="tg-e3zv">year</th>
    <th class="tg-9hbo">category</th>
    <th class="tg-9hbo">name</th>
    <th class="tg-9hbo">motivation</th>
  </tr>
  <tr>
    <td class="tg-yw4l">2011</td>
    <td class="tg-yw4l">literature</td>
    <td class="tg-yw4l">Tomas Transtr√∂mer</td>
    <td class="tg-yw4l">...</td>
  </tr>
  <tr>
    <td class="tg-yw4l">2011</td>
    <td class="tg-yw4l">physics</td>
    <td class="tg-yw4l">Adam Riess</td>
    <td class="tg-yw4l">...</td>
  </tr>
  <tr>
    <td class="tg-yw4l">2011</td>
    <td class="tg-yw4l">chemistry</td>
    <td class="tg-yw4l">Dan Shechtman</td>
    <td class="tg-yw4l">...</td>
  </tr>
  <tr>
    <td class="tg-yw4l">2011</td>
    <td class="tg-yw4l">medicine</td>
    <td class="tg-yw4l">Ralph Steinman</td>
    <td class="tg-yw4l">...</td>
  </tr>
</table>

A _row_ represents an item, and a _column_ represents a
property of the items.

In the example above, each row describes a Nobel laurate,
and for each laureate, we have columns showing what year the
prize was awarded, in what category, the name of the
laureate, and the motivation (not shown here).

The basic idea of relational databases is that all 'cells'
in the table should be simple values (no lists or objects!),
and that we can use simple operations from [_relational
algebra_](https://en.wikipedia.org/wiki/Relational_algebra)
to get information from it. We do it using a programming
language which is highly specialized for extracting
information, it is called
[SQL](https://en.wikipedia.org/wiki/SQL), which is short
hand for _Structured Query Language_. SQL can be pronounced
as either "S-Q-L", or "sequel".

SQL is divided into several sub-languages:

 + _DDL_ (_Data Definition Language_): constructs used to
   define the tables of a database,

 + _DML_ (_Data Manipulation Language_): statements used to
   query and manipulate data in a database,
   
 + _TCL_ (_Transaction Control Language_): commands used to
   handle transactions (we will return to what a transaction
   is later in the course), and
   
 + _DCL_ (_Data Control Language_): commands used to
   controll access to our data (we'll will not deal with
   them in this course).

This week we'll focus on DML, i.e., ways to query our
databases -- next week we'll look at how to design and
define our databases.

Today, we'll discuss the following operations:

 + _selection_: choosing some of the rows of a table

 + _projection_: choosing some of the columns of a table

 + _union_ and _intersection_: combining the rows of two
   tables into one table (the tables we combine must be
   compatible, which means that they must have the same
   columns)
   
Next time we'll study some other very important operations,
which allows us to join several tables in interesting ways.

## An actual DBMS

There are many different Relational Database Management
Systems
([RDMBS:es](https://en.wikipedia.org/wiki/Relational_database))
which implements SQL, some of the most prominent are:

 *  [PostgreSQL](https://en.wikipedia.org/wiki/PostgreSQL)
 *  [Oracle](https://en.wikipedia.org/wiki/Oracle_Database)
 *  [MariaDB](https://en.wikipedia.org/wiki/MariaDB)
 *  [MySQL](https://en.wikipedia.org/wiki/MySQL)
 *  [Microsoft SQL Server](https://en.wikipedia.org/wiki/Microsoft_SQL_Server)
 *  [IBM DD2](https://en.wikipedia.org/wiki/IBM_Db2_Family)
 *  [SQLite](https://en.wikipedia.org/wiki/SQLite)

In this course we'll use
[SQLite](https://en.wikipedia.org/wiki/SQLite), which is a
lightweight but still very powerful system -- it is _by far_
the most used DBMS, and it's probably already running on all
of your phones and computers (just as an example, if you use
the Chrome for browsing, your browsing history is typically
saved in a SQL-database file
`.config/google-chrome/Default/History `).

The `SQLite` file `lect01.sqlite` contains all Nobel
Laureates in Physicis, Chemistry, Medicine, and Literature
since 1901 (the Economics prize isn't really a Nobel prize,
its an award given since 1969 by Riksbanken in memory of
Alfred Nobel, and the Peace Prize is awarded by Norwegians).
At the bottom of this page there's a description of how I
created the database.

To be able to write SQL queries in this notebook, we first
have to run:

In [ ]:
%load_ext sql

And to work with our database, we import it with:

In [ ]:
%sql sqlite:///lect01.sqlite

Now we're good to go, we just have to prefix our SQL queries
with `%sql` (one line of SQL) or `%%sql` (several lines of
SQL, this is the form we will use in most cases).

## Some queries

A simple _SQL query_ can be written as:

~~~{.text}
SELECT <what we're looking for>
FROM   <what table we're looking in>
~~~

This selects all rows of a given table. If we're only
interesting in some of the rows, and we normally are, we
write:

~~~{.text}
SELECT <what we're looking for>
FROM   <what table we're looking in>
WHERE  <what items we're interested in>
~~~

The latter form is so common that it's got its own acronym:
"SFW" (short for `SELECT`-`FROM`-`WHERE`).

Our Nobel Database contains the following information for
each laureate:

 *  the _year_ the prize was awarded
 *  the _category_ ('physics', 'chemistry', 'medicine',
    'literature')
 *  the _name_
 *  the _motivation_

Let's use the first form above to see all Nobel prizes which
has been handed out:

In [ ]:
%%sql

This is too much to look through, so let's first limit the
output to 10 rows:

In [ ]:
%%sql

We can also _select_ only those prizes awarded in 2013.

In [ ]:
%%sql

Observe that the query returns a new table, we'll soon see
that we can use the returned table in other queries.

**Q:** _What year did Einstein get his award, and why?_

This requires both a _selection_ (the row with Einstein's
award) and a _projection_ (only the year and motivation):

In [ ]:
%%sql

Observe that the selection (what rows we're interested in)
is given in the `WHERE` clause, whereas the projection (what
columns we're interested in) is defined in the `SELECT`
clause (the naming is somewhat counter-intuitive).

The names of the columns in the returned table is shown
above the actual output, if we want to rename any of the
columns in the returned table, we can use an _alias_:

In [ ]:
%%sql

**Q:** _Who was awarded the physics prize in 1922?_

In [ ]:
%%sql

**Q:** _Who were awarded the physics prize in 1922 and
1923?_ (Solve this problem in at least three different
ways).

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

There are often several ways of doing things in SQL, and one
of the main points of using SQL is that the RDBMS tries to
optimize the operations it needs to fetch our data (there is
some seriously clever code running behind the scenes).

**Q:** _Who has been awarded the prize in medicine since
2010, ordered by name?_

In [ ]:
%%sql

**Q:** _What year did Winston Churchill win a prize, and in
what category?_

In [ ]:
%%sql

Using `LIKE` in our conditions, we get some rudimentary form
of wildcard matching (some SQL databases allow more advanced
regular expressions, but that's beyond the scope of this
course).


If we want to categorize our output, we can use a `CASE`
statement, it has the general form:

~~~sql
SELECT ..., 
       CASE 
           WHEN ... THEN ...
           WHEN ... THEN ...
           ELSE ...
       END AS <name>
FROM ...
~~~

**Q:** _Show all laureates in physics with a name beginning
with 'P', if they won the prize before 1970 they're ancient,
if the won the prize between 1970 and 2000 they're veterans,
otherwise they're newbies._

In [ ]:
%%sql

### `SELECT` and `SELECT DISTINCT`

**Q:** _What are the different categories of Nobel prizes?_

In [ ]:
%%sql

Using `SELECT DISTINCT` we only get unique rows in our
output table.


### Using functions and aggregate functions

There are some functions we can apply to our values, each
RDBMS supplies their own set of functions. For example,
SQLite has a `substr` function:

~~~sql
substr(value, first_pos, [length])
~~~

**Q:** _What was the initial letters of the laureates in
year 2000?_

In [ ]:
%%sql

An _aggregate function_ can be applied to all rows in a
table, and then returns only one value.

The standard aggregate functions are:

 + `AVG`: calculates the average for a given column
 + `COUNT`: counts the rows in a given table
 + `MIN`: gets the minimum value of a given column
 + `MAX`: gets the maximum value of a given column
 + `SUM`: calculates the sum of a given column


**Q:** _How many of the laureates has had a first name
beginning with an 'A'?_

In [ ]:
%%sql

**Q:** _What year was the first Nobel prize awarded?_

In [ ]:
%%sql

**Q:** _How many Nobel prizes for chemistry has been
awarded?_

In [ ]:
%%sql

### Groups and aggregates

Using `GROUP BY` we can handle rows in groups -- to
understand how it works, lets first look at the following
query:

In [ ]:
%%sql
SELECT    year, category, name
FROM      nobel
WHERE     year = 2013
ORDER BY  category

Here the rows of each category will end up adjacent to each
other, and using `GROUP BY` we insert an invisible divider
between the groups, and perform any aggregate function on
the whole 'group':

In [ ]:
%%sql
SELECT    category, count()
FROM      nobel
WHERE     year = 2013
GROUP BY  category

So, if we apply an aggregate function, such as `count()`, in
a table which we have grouped, it will be applied to each
group, not to the whole table. Instead of getting one
`count()` for the whole table (it would be a single value),
we get one `count()` for each group (as above).

If we add `name` in the first line, we get a somewhat
arbitrary result:

In [ ]:
%%sql
SELECT    category, count(), name
FROM      nobel
WHERE     year = 2013
GROUP BY  category

The category and count is correct, but only one name is
shown for each category.

The 'problem' is that we only get one row per group in the
output, and that there may be several laureates in each
group -- our query will return one of them in a seemingly
haphazard manner. We can concatenate all names in the group
using the `group_concat`-function:

In [ ]:
%%sql
SELECT    category, count(), group_concat(name)
FROM      nobel
WHERE     year = 2013
GROUP BY  category

There is no problem displaying `category` in the
`SELECT`-statement above, we get a value which we know is
the same for each row in the group (by definition, since
that's what we grouped by).


If we're only interested in those categories with less than
three laureates, we use `HAVING` to select only _groups_
with a given property:

In [ ]:
%%sql
SELECT    category, count(), group_concat(name)
FROM      nobel
WHERE     year = 2013
GROUP BY  category
HAVING    count() < 3

This corresponds to a `WHERE` statement, but it applies to
groups, not to individual rows (as `WHERE` does). In the
query above we first have a `WHERE` statement to select some
rows from the whole table, and then group the resulting
selection.



**Q:** _How many laureates are there in each category? Which
category has seen the most laureates?_

In [ ]:
%%sql

**Q:** _How many olympic games has each continent hosted?_

In [ ]:
%%sql

**Q:** _When was the first olympic games in each continent?_

In [ ]:
%%sql

**Q:** _Which countries has hosted the summer olympics more
than once?_

In [ ]:
%%sql

**Q:** _List the continents in descending order by the
number of times they've hosted the summer olympics_

In [ ]:
%%sql

**Q:** _Show an 'histogram' over the the initial letter of
the names of all Nobel laureates_

In [ ]:
%%sql

We can group by more than one column, we now insert
invisible borders between all combinations of the given
column values:


**Q:** _Show an 'histogram' over the the initial letter of
the names of all Nobel laureates, **for each category**_

In [ ]:
%%sql

**Q:** _Has anyone won more than one Nobel prize?_

In [ ]:
%%sql

**Q:** _Has anyone won more than one Nobel prize in the same
category?_

In [ ]:
%%sql

### Subqueries

As we noted above, the result of a `SELECT`-statement is
itself a table, and we can use such a table inside other
statements.

One useful pattern is:

~~~sql
SELECT ...
FROM   ...
WHERE  ... IN
       (SELECT ...
        FROM ...
        WHERE ...)
~~~

The second query is called a _subquery_.


**Q:** _Has the Nobel prize for literature ever been split?_

In [ ]:
%%sql

**Q:** _Which literature laureates split their prizes?_

In [ ]:
%%sql

There is another form of subquery which we'll return to
later.

**Q:** _Who has won the literature prize in a year when at
least one chemistry laureate had a name beginning with 'L'?_

In [ ]:
%%sql

**Q:** _Who has shared the chemistry prize with exactly one
other laureate in years when the summer olympics were held
in Europe?_

In [ ]:
%%sql

Another form of subquery is:

~~~sql
SELECT ...,
       (SELECT ...
        FROM ...
        WHERE ...)
FROM   ...
~~~

This works if the subquery produces one result, such as when
we use an aggregate function. As an example, solve the
following problem:

**Q:** _Output the name of all laureates, and the number of
awards they have -- order first by number of awards, then by
name, and show only the first 20._

In [ ]:
%%sql

~~~sql
%%sql

~~~

This is called a _correlated subquery_ (since we refer to
the enclosing query inside it). We use an alias to
distinguish between the nobel table in the outer query and
the nobel table in the subquery (it's the same table, but we
'iterate' through it separately).

For the next lecture: is there any redundance in the table
with the olympic games?



## Generating the database

This is a description of how I created the database, it's
just for the curious, and not part of the course.

The data is copied from
[`Nobelprize.org`](https://www.nobelprize.org/nobel_prizes/lists/all/create_list.html),
and then pasted into a text file `nobel.csv` (`.csv` for
comma-separated-values). I used `Emacs` to tidy things up
(just some simple macros), and then I imported the text file
into `sqlite` using the following script (I put it in the
text file `nobel.sql`):

~~~{sql}
DROP TABLE IF EXISTS nobel;
CREATE TABLE nobel (
  year        INT,
  category    TEXT,
  name        TEXT,
  motivation  TEXT
);

.mode csv
.separator ';'
.import nobel.csv nobel
~~~

To create a `sqlite`-file `nobel.sqlite` with all laureates,
I only had to run the following command in a terminal (the
exclamation sign tells `jupyter` to execute a shell
command):

In [ ]:
!sqlite3 nobel.sqlite < nobel.sql

You can find information about running
[SQLite](http://sqlite.org/) from a command line
[here](https://sqlite.org/cli.html). I could have made
things somewhat easier for myself by adding an extra header
row first in my `.csv`-file, but I wanted to define the
table myself, to make sure that `year` was saved as integers
-- we'll return to this later in the course.